ftsergioero/git_test/dwt_msp430_lea.c
#include <msp430.h>
#include "dsplib.h"
#include <stdint.h>

// Coiflet 1 filter coefficients (normalized)
const float coif1_lo[6] = {-0.0157, -0.0727, 0.3849, 0.8526, 0.3379, -0.0727};
const float coif1_hi[6] = {0.0727, 0.3379, -0.8526, 0.3849, 0.0727, -0.0157};

// Buffer sizes and data structures
#define MAX_BUFFER_SIZE 1024
#define NUM_LEVELS 5

// Buffers for approximation and detail coefficients at each level
static float approx_coeffs[NUM_LEVELS+1][MAX_BUFFER_SIZE];
static float detail_coeffs[NUM_LEVELS+1][MAX_BUFFER_SIZE];
static uint16_t coeffs_length[NUM_LEVELS+1];

// LEA vector for efficient processing
static _q15 lea_buffer[MAX_BUFFER_SIZE];
static msp_status status;

// Function prototypes
void init_dwt(void);
void apply_filters(float *input, uint16_t input_length, float *low_output, float *high_output, uint16_t *output_length);
float calculate_criterion(float *details_level4, float *details_level5, uint16_t length4, uint16_t length5);
void dwt_decomposition(float *input_signal, uint16_t signal_length);

// Initialize DWT processing
void init_dwt(void) {
    // Initialize LEA module
    status = msp_matrix_init();
    if (status != MSP_SUCCESS) {
        // Handle initialization error
        while(1);
    }
}

// Apply low-pass and high-pass filters using LEA
void apply_filters(float *input, uint16_t input_length, float *low_output, 
                  float *high_output, uint16_t *output_length) {
    
    uint16_t i;
    *output_length = input_length / 2;

    // Convert float input to Q15 format for LEA
    for(i = 0; i < input_length; i++) {
        lea_buffer[i] = (int16_t)(input[i] * 32768.0f);
    }

    // Apply low-pass filter using LEA FIR function
    msp_fir_q15_params firParams;
    firParams.length = 6;  // Coiflet 1 length
    firParams.coeffs = (int16_t *)coif1_lo;
    
    status = msp_fir_q15(&firParams, lea_buffer, low_output);
    
    // Apply high-pass filter
    firParams.coeffs = (int16_t *)coif1_hi;
    status = msp_fir_q15(&firParams, lea_buffer, high_output);

    // Downsample (take every other sample)
    for(i = 0; i < *output_length; i++) {
        low_output[i] = low_output[i * 2] / 32768.0f;
        high_output[i] = high_output[i * 2] / 32768.0f;
    }
}

// Calculate criterion between levels 4 and 5
float calculate_criterion(float *details_level4, float *details_level5, 
                        uint16_t length4, uint16_t length5) {
    float energy_level4 = 0.0f;
    float energy_level5 = 0.0f;
    uint16_t i;

    // Convert to Q15 for LEA processing
    for(i = 0; i < length4; i++) {
        lea_buffer[i] = (int16_t)(details_level4[i] * 32768.0f);
    }

    // Calculate energy of level 4 details using LEA
    msp_cmplx_q15_params energyParams;
    energyParams.length = length4;
    status = msp_cmplx_mag_q15(&energyParams, lea_buffer, lea_buffer);
    
    // Sum the magnitudes
    for(i = 0; i < length4; i++) {
        energy_level4 += (float)lea_buffer[i] / 32768.0f;
    }

    // Repeat for level 5
    for(i = 0; i < length5; i++) {
        lea_buffer[i] = (int16_t)(details_level5[i] * 32768.0f);
    }
    
    energyParams.length = length5;
    status = msp_cmplx_mag_q15(&energyParams, lea_buffer, lea_buffer);
    
    for(i = 0; i < length5; i++) {
        energy_level5 += (float)lea_buffer[i] / 32768.0f;
    }

    // Return ratio of energies as criterion
    return energy_level4 / energy_level5;
}

// Main DWT decomposition function
void dwt_decomposition(float *input_signal, uint16_t signal_length) {
    uint16_t current_length = signal_length;
    uint16_t level;

    // Copy input signal to first level approximation
    for(uint16_t i = 0; i < signal_length; i++) {
        approx_coeffs[0][i] = input_signal[i];
    }
    coeffs_length[0] = signal_length;

    // Perform decomposition for each level
    for(level = 1; level <= NUM_LEVELS; level++) {
        apply_filters(approx_coeffs[level-1], current_length,
                     approx_coeffs[level], detail_coeffs[level],
                     &coeffs_length[level]);
        
        current_length = coeffs_length[level];

        // Apply criterion between levels 4 and 5
        if(level == 5) {
            float criterion = calculate_criterion(detail_coeffs[4], detail_coeffs[5],
                                               coeffs_length[4], coeffs_length[5]);
            
            // Example threshold-based decision
            if(criterion > 2.0f) {
                // High frequency content is significantly different
                // Add processing logic here
            }
        }
    }
}

// Example usage
int main(void) {
    WDTCTL = WDTPW | WDTHOLD;   // Stop watchdog timer
    
    // Initialize DWT
    init_dwt();
    
    // Example input signal (replace with actual data)
    float input_signal[MAX_BUFFER_SIZE];
    uint16_t signal_length = 512;  // Example length
    
    // Fill input signal with data
    for(uint16_t i = 0; i < signal_length; i++) {
        input_signal[i] = 0.0f; // Replace with actual signal data
    }
    
    // Perform DWT decomposition
    dwt_decomposition(input_signal, signal_length);
    
    // Process results
    while(1);
    
    return 0;
}